package org.javastart.homework4;

public class Alphabet {
    public static void main(String[] args) {
//4. Создать программу, которая печатает все маленькие
// символы латинского алфавита(использовать любой цикл).
        System.out.println("English alphabet: ");
        for (char c = 'a'; c <='z'; c++) {
            System.out.print(c);
        }
    }
}
